; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	image0 - mode
	spectrograph1 - mode
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation12 - direction
	GroundStation7 - direction
	Star8 - direction
	Star11 - direction
	Star9 - direction
	Star1 - direction
	Star10 - direction
	Star2 - direction
	Star0 - direction
	Star4 - direction
	GroundStation14 - direction
	GroundStation13 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 Star11)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 spectrograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation14)
	(supports instrument3 image0)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star11)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation13)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star10)
	(supports instrument5 image0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star10)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation13)
	(supports instrument6 spectrograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation13)
	(calibration_target instrument6 GroundStation14)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation14)
)
(:goal (and
	(pointing satellite1 Star4)
	(pointing satellite3 Phenomenon20)
	(have_image Planet15 spectrograph1)
	(have_image Star16 spectrograph1)
	(have_image Star17 image0)
	(have_image Star18 spectrograph1)
	(have_image Phenomenon20 spectrograph1)
	(have_image Planet21 image0)
))

)

; plan
1. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 8
2. (calibrate satellite3 instrument6 groundstation14)
   added: (calibrated instrument6)
   goals met: 0 of 8
3. (turn_to satellite3 star16 groundstation14)
   deleted: (pointing satellite3 groundstation14)
   added: (pointing satellite3 star16)
   goals met: 0 of 8
4. (take_image satellite3 star16 instrument6 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 1 of 8
5. (turn_to satellite3 planet21 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 planet21)
   goals met: 1 of 8
6. (take_image satellite3 planet21 instrument6 image0)
   added: (have_image planet21 image0)
   goals met: 2 of 8
7. (turn_to satellite3 planet15 planet21)
   deleted: (pointing satellite3 planet21)
   added: (pointing satellite3 planet15)
   goals met: 2 of 8
8. (turn_to satellite1 star4 groundstation13)
   deleted: (pointing satellite1 groundstation13)
   added: (pointing satellite1 star4)
   goals met: 3 of 8
9. (take_image satellite3 planet15 instrument6 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 4 of 8
10. (turn_to satellite3 star17 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 star17)
   goals met: 4 of 8
11. (take_image satellite3 star17 instrument6 image0)
   added: (have_image star17 image0)
   goals met: 5 of 8
12. (turn_to satellite3 star18 star17)
   deleted: (pointing satellite3 star17)
   added: (pointing satellite3 star18)
   goals met: 5 of 8
13. (take_image satellite3 star18 instrument6 spectrograph1)
   added: (have_image star18 spectrograph1)
   goals met: 6 of 8
14. (turn_to satellite3 phenomenon20 star18)
   deleted: (pointing satellite3 star18)
   added: (pointing satellite3 phenomenon20)
   goals met: 7 of 8
15. (take_image satellite3 phenomenon20 instrument6 spectrograph1)
   added: (have_image phenomenon20 spectrograph1)
   goals met: 8 of 8
